[
    {
        "id": 0,
        "title": "Booki",
        "cover": "assets/images/Screenshot_Booki.avif",
        "description": "Intégration de la page d'accueil du site Booki avec HTML - CSS",
        "skills": [
            "Intégration conforme à une maquette",
            "Implémentation d'une interface responsive"
        ],
        "problems": "J'ai rencontré des difficultés avec Flexbox pour la mise en place du responsive, notamment la hiérarchie des sélecteurs CSS vis-à-vis de la structure HTML.\nPour remédier à ce problème, j'ai lu beaucoup de documentation sur Flexbox (mdn,...) et j'ai aussi beaucoup \"joué\" avec le CSS sur codepen.io. Cela m'a permis d'intégrer la page d'accueil de Booki correctement, avec une compréhension claire des comportements CSS.",
        "githubUrl": "https://github.com/sibeni-li/projet_2",
        "siteUrl":"https://booki-4el.pages.dev"
    },
    {
        "id": 1,
        "title": "Sophie Bluel - Architecte d'intérieur",
        "cover": "assets/images/Screenshot_Sophie_Bluel.avif",
        "description": "Création d'une page web dynamique avec JavaScript",
        "skills": [
            "Gérer des événements utilisateurs",
            "Récupérer des données utilisateurs dans JavaScript via des formulaires",
            "Manipuler le DOM"
        ],
        "problems": "Les plus grands défis ont été la mise en place les appels API et la modale.\nPour l'API, je me suis longuement référée aux cours OpenClassrooms et à la documentation mdn.\nPour la modale, j'ai suivi le tuto de Grafikart.fr, car il est très bien expliqué et permet de bien comprendre le code. Grâce à cela, j'ai finalement réussi à terminer ce projet.",
        "githubUrl": "https://github.com/sibeni-li/Project-3",
        "siteUrl":"https://sophie-bluel.pages.dev/"
    },
    {
        "id": 2,
        "title": "Nina Carducci - Photographe",
        "cover": "/assets/images/Screenshot_Nina_Carducci.avif",
        "description": "Débug et optimisation d'un site de photographe avec les Chrome DevTools, Lighthouse et Wave",
        "skills": [
            "Optimiser les performances d'un site web",
            "Débugger un site web grâce aux Chrome DevTools",
            "Rédiger un cahier de recette pour tester un site"
        ],
        "problems": "L'objectif était l'optimisation des performances du site. En effet, il fallait faire un travail de fond, nottament sur les images en perdant le moins possible en qualité.\nPour résoudre ce problème, je me suis renseignée sur la compression des formats actuels d'image (webp, avif), qui permettent un excellent ratio qualité:compression.",
        "githubUrl": "https://github.com/sibeni-li/projet_4",
        "siteUrl":"https://sibeni-li.github.io/projet_4"
    },
    {
        "id": 3,
        "title": "Kasa",
        "cover": "assets/images/Screenshot_Kasa.avif",
        "description": "Création d'un site de location immobilière avec React et Sass",
        "skills": [
            "Initialiser une application avec Create React App",
            "Configurer la navigation entre les pages de l'application avec React Router",
            "Développer des éléments de l'interface d'un site web grâce à des composants React",
            "Mettre en oeuvre des animations CSS",
            "Développer une interface web avec Sass"
        ],
        "problems": "J'avais quelques incompréhensions fondamentales dans l'utilisation des hooks, et des props entre les composants.\nJ'ai été voir des vidéos YouTube (entre autres \"Apprendre React en 1h\" de \"ViDev\"), qui m'ont vraiment permis d'avoir une vision plus claire du fonctionnement de React et des composants.",
        "githubUrl": "https://github.com/sibeni-li/projet_5",
        "siteUrl":"https://kasa-app.pages.dev"
    },
    {
        "id": 4,
        "title": "Mon vieux Grimoir",
        "cover": "assets/images/Screenshot_Vieux_Grimoir.avif",
        "description": "Développement du back-end d'un site de notation de livres avec Node.js, Express.js et MongoDB",
        "skills": [
            "Implémenter un modèle de données conformément à la réglementation",
            "Mettre en oeuvre des opérations CRUD de manière sécurisée",
            "Stocker des données de manière sécurisée"
        ],
        "problems": "Je n'ai pas rencontré de difficulté majeure ; juste une petite erreur de logique.\nJe me suis aidée de la doc, et surtout j'ai relu mon code, jusqu'à m'apercevoir qu'il manquait une instruction.",
        "githubUrl": "https://github.com/sibeni-li/projet_6",
        "siteUrl":"https://vg-frontend.pages.dev/"
    }
]